let messages = [
  { text: 'Hello', from: 'John' },
  { text: 'How goes?', from: 'John' },
  { text: 'See you soon', from: 'Alice' },
];
//«когда сообщение прочитано?»
// после выведения сообщения message[i] на экран пользователя добавлять его в коллекцию WeakMap с ключём в виде этого объекта-сообщения и значением текущей даты-времения
newWeakMap.set([message[i], new Date()]);
// т.о у нас будет инфрмация о том когда крайний раз это сообщение выводилось на экран
// после удаления сообщения из массива - соответствующие ключ-значения тоже удалятся
